GopalSaraf/Practicals/PSDL/include/proc/pic18f2431.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_STKPTR0_POSN                      equ 0000h
STKPTR_STKPTR0_POSITION                  equ 0000h
STKPTR_STKPTR0_SIZE                      equ 0001h
STKPTR_STKPTR0_LENGTH                    equ 0001h
STKPTR_STKPTR0_MASK                      equ 0001h
STKPTR_STKPTR1_POSN                      equ 0001h
STKPTR_STKPTR1_POSITION                  equ 0001h
STKPTR_STKPTR1_SIZE                      equ 0001h
STKPTR_STKPTR1_LENGTH                    equ 0001h
STKPTR_STKPTR1_MASK                      equ 0002h
STKPTR_STKPTR2_POSN                      equ 0002h
STKPTR_STKPTR2_POSITION                  equ 0002h
STKPTR_STKPTR2_SIZE                      equ 0001h
STKPTR_STKPTR2_LENGTH                    equ 0001h
STKPTR_STKPTR2_MASK                      equ 0004h
STKPTR_STKPTR3_POSN                      equ 0003h
STKPTR_STKPTR3_POSITION                  equ 0003h
STKPTR_STKPTR3_SIZE                      equ 0001h
STKPTR_STKPTR3_LENGTH                    equ 0001h
STKPTR_STKPTR3_MASK                      equ 0008h
STKPTR_STKPTR4_POSN                      equ 0004h
STKPTR_STKPTR4_POSITION                  equ 0004h
STKPTR_STKPTR4_SIZE                      equ 0001h
STKPTR_STKPTR4_LENGTH                    equ 0001h
STKPTR_STKPTR4_MASK                      equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0, a
#define ABDOVF                           BANKMASK(BAUDCON), 7, a
#define ACMOD0                           BANKMASK(ADCON0), 2, a
#define ACMOD1                           BANKMASK(ADCON0), 3, a
#define ACONV                            BANKMASK(ADCON0), 5, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define ACQT3                            BANKMASK(ADCON2), 6, a
#define ACSCH                            BANKMASK(ADCON0), 4, a
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN                            BANKMASK(RCSTA), 3, a
#define ADEN                             BANKMASK(RCSTA), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define ADPNT0                           BANKMASK(ADCON1), 0, a
#define ADPNT1                           BANKMASK(ADCON1), 1, a
#define ADRS0                            BANKMASK(ADCON3), 6, a
#define ADRS1                            BANKMASK(ADCON3), 7, a
#define AN0                              BANKMASK(PORTA), 0, a
#define AN1                              BANKMASK(PORTA), 1, a
#define AN2                              BANKMASK(PORTA), 2, a
#define AN3                              BANKMASK(PORTA), 3, a
#define AN4                              BANKMASK(PORTA), 4, a
#define ANS0                             BANKMASK(ANSEL0), 0, a
#define ANS1                             BANKMASK(ANSEL0), 1, a
#define ANS2                             BANKMASK(ANSEL0), 2, a
#define ANS3                             BANKMASK(ANSEL0), 3, a
#define ANS4                             BANKMASK(ANSEL0), 4, a
#define BF                               BANKMASK(SSPSTAT), 0, a
#define BFEMT                            BANKMASK(ADCON1), 3, a
#define BFOVFL                           BANKMASK(ADCON1), 2, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRFEN                            BANKMASK(FLTCONFIG), 7, a
#define BRG16                            BANKMASK(BAUDCON), 3, a
#define BRGH                             BANKMASK(TXSTA), 2, a
#define BRGH1                            BANKMASK(TXSTA), 2, a
#define CAP1M0                           BANKMASK(CAP1CON), 0, a
#define CAP1M1                           BANKMASK(CAP1CON), 1, a
#define CAP1M2                           BANKMASK(CAP1CON), 2, a
#define CAP1M3                           BANKMASK(CAP1CON), 3, a
#define CAP1REN                          BANKMASK(CAP1CON), 6, a
#define CAP1TMR                          BANKMASK(CAP1CON), 5, a
#define CAP2M0                           BANKMASK(CAP2CON), 0, a
#define CAP2M1                           BANKMASK(CAP2CON), 1, a
#define CAP2M2                           BANKMASK(CAP2CON), 2, a
#define CAP2M3                           BANKMASK(CAP2CON), 3, a
#define CAP2REN                          BANKMASK(CAP2CON), 6, a
#define CAP2TMR                          BANKMASK(CAP2CON), 5, a
#define CAP3M0                           BANKMASK(CAP3CON), 0, a
#define CAP3M1                           BANKMASK(CAP3CON), 1, a
#define CAP3M2                           BANKMASK(CAP3CON), 2, a
#define CAP3M3                           BANKMASK(CAP3CON), 3, a
#define CAP3REN                          BANKMASK(CAP3CON), 6, a
#define CAP3TMR                          BANKMASK(CAP3CON), 5, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 2, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP1X                            BANKMASK(CCP1CON), 5, a
#define CCP1Y                            BANKMASK(CCP1CON), 4, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CCP2IE                           BANKMASK(PIE2), 0, a
#define CCP2IF                           BANKMASK(PIR2), 0, a
#define CCP2IP                           BANKMASK(IPR2), 0, a
#define CCP2M0                           BANKMASK(CCP2CON), 0, a
#define CCP2M1                           BANKMASK(CCP2CON), 1, a
#define CCP2M2                           BANKMASK(CCP2CON), 2, a
#define CCP2M3                           BANKMASK(CCP2CON), 3, a
#define CCP2X                            BANKMASK(CCP2CON), 5, a
#define CCP2Y                            BANKMASK(CCP2CON), 4, a
#define CCP2_PA2                         BANKMASK(PORTB), 3, a
#define CCP9E                            BANKMASK(PORTE), 3, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTC), 6, a
#define CKE                              BANKMASK(SSPSTAT), 6, a
#define CKP                              BANKMASK(SSPCON), 4, a
#define CLKI                             BANKMASK(PORTA), 7, a
#define CLKO                             BANKMASK(PORTA), 6, a
#define CREN                             BANKMASK(RCSTA), 4, a
#define CSRC                             BANKMASK(TXSTA), 7, a
#define CSRC1                            BANKMASK(TXSTA), 7, a
#define DA                               BANKMASK(SSPSTAT), 5, a
#define DATA_ADDRESS                     BANKMASK(SSPSTAT), 5, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DC2B0                            BANKMASK(CCP2CON), 4, a
#define DC2B1                            BANKMASK(CCP2CON), 5, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DOWN                             BANKMASK(QEICON), 5, a
#define DT                               BANKMASK(PORTC), 7, a
#define DT0                              BANKMASK(DTCON), 0, a
#define DT1                              BANKMASK(DTCON), 1, a
#define DT2                              BANKMASK(DTCON), 2, a
#define DT3                              BANKMASK(DTCON), 3, a
#define DT4                              BANKMASK(DTCON), 4, a
#define DT5                              BANKMASK(DTCON), 5, a
#define DTA0                             BANKMASK(DTCON), 0, a
#define DTA1                             BANKMASK(DTCON), 1, a
#define DTA2                             BANKMASK(DTCON), 2, a
#define DTA3                             BANKMASK(DTCON), 3, a
#define DTA4                             BANKMASK(DTCON), 4, a
#define DTA5                             BANKMASK(DTCON), 5, a
#define DTAPS0                           BANKMASK(DTCON), 6, a
#define DTAPS1                           BANKMASK(DTCON), 7, a
#define DTPS0                            BANKMASK(DTCON), 6, a
#define DTPS1                            BANKMASK(DTCON), 7, a
#define D_A                              BANKMASK(SSPSTAT), 5, a
#define D_NOT_A                          BANKMASK(SSPSTAT), 5, a
#define D_nA                             BANKMASK(SSPSTAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define FERR                             BANKMASK(RCSTA), 2, a
#define FFOVFL                           BANKMASK(ADCON1), 2, a
#define FIFOEN                           BANKMASK(ADCON1), 4, a
#define FLT1EN                           BANKMASK(DFLTCON), 3, a
#define FLT2EN                           BANKMASK(DFLTCON), 4, a
#define FLT3EN                           BANKMASK(DFLTCON), 5, a
#define FLT4EN                           BANKMASK(DFLTCON), 6, a
#define FLTA                             BANKMASK(PORTC), 1, a
#define FLTAEN                           BANKMASK(FLTCONFIG), 0, a
#define FLTAMOD                          BANKMASK(FLTCONFIG), 1, a
#define FLTAS                            BANKMASK(FLTCONFIG), 2, a
#define FLTB                             BANKMASK(PORTC), 2, a
#define FLTBEN                           BANKMASK(FLTCONFIG), 4, a
#define FLTBMOD                          BANKMASK(FLTCONFIG), 5, a
#define FLTBS                            BANKMASK(FLTCONFIG), 6, a
#define FLTCK0                           BANKMASK(DFLTCON), 0, a
#define FLTCK1                           BANKMASK(DFLTCON), 1, a
#define FLTCK2                           BANKMASK(DFLTCON), 2, a
#define FLTCON                           BANKMASK(FLTCONFIG), 3, a
#define FLTS                             BANKMASK(OSCCON), 2, a
#define FREE                             BANKMASK(EECON1), 4, a
#define GASEL0                           BANKMASK(ADCHS), 0, a
#define GASEL1                           BANKMASK(ADCHS), 1, a
#define GBSEL0                           BANKMASK(ADCHS), 4, a
#define GBSEL1                           BANKMASK(ADCHS), 5, a
#define GCSEL0                           BANKMASK(ADCHS), 2, a
#define GCSEL1                           BANKMASK(ADCHS), 3, a
#define GDSEL0                           BANKMASK(ADCHS), 6, a
#define GDSEL1                           BANKMASK(ADCHS), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define IC1IE                            BANKMASK(PIE3), 1, a
#define IC1IF                            BANKMASK(PIR3), 1, a
#define IC1IP                            BANKMASK(IPR3), 1, a
#define IC2QEIE                          BANKMASK(PIE3), 2, a
#define IC2QEIF                          BANKMASK(PIR3), 2, a
#define IC2QEIP                          BANKMASK(IPR3), 2, a
#define IC3DRIE                          BANKMASK(PIE3), 3, a
#define IC3DRIF                          BANKMASK(PIR3), 3, a
#define IC3DRIP                          BANKMASK(IPR3), 3, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTC), 3, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTC), 4, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTC), 5, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define IOFS                             BANKMASK(OSCCON), 2, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define IRVST                            BANKMASK(LVDCON), 5, a
#define IVRST                            BANKMASK(LVDCON), 5, a
#define LA0                              BANKMASK(LATA), 0, a
#define LA1                              BANKMASK(LATA), 1, a
#define LA2                              BANKMASK(LATA), 2, a
#define LA3                              BANKMASK(LATA), 3, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA6                              BANKMASK(LATA), 6, a
#define LA7                              BANKMASK(LATA), 7, a
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LB0                              BANKMASK(LATB), 0, a
#define LB1                              BANKMASK(LATB), 1, a
#define LB2                              BANKMASK(LATB), 2, a
#define LB3                              BANKMASK(LATB), 3, a
#define LB4                              BANKMASK(LATB), 4, a
#define LB5                              BANKMASK(LATB), 5, a
#define LB6                              BANKMASK(LATB), 6, a
#define LB7                              BANKMASK(LATB), 7, a
#define LC0                              BANKMASK(LATC), 0, a
#define LC1                              BANKMASK(LATC), 1, a
#define LC2                              BANKMASK(LATC), 2, a
#define LC3                              BANKMASK(LATC), 3, a
#define LC4                              BANKMASK(LATC), 4, a
#define LC5                              BANKMASK(LATC), 5, a
#define LC6                              BANKMASK(LATC), 6, a
#define LC7                              BANKMASK(LATC), 7, a
#define LVDEN                            BANKMASK(LVDCON), 4, a
#define LVDIE                            BANKMASK(PIE2), 2, a
#define LVDIF                            BANKMASK(PIR2), 2, a
#define LVDIP                            BANKMASK(IPR2), 2, a
#define LVDL0                            BANKMASK(LVDCON), 0, a
#define LVDL1                            BANKMASK(LVDCON), 1, a
#define LVDL2                            BANKMASK(LVDCON), 2, a
#define LVDL3                            BANKMASK(LVDCON), 3, a
#define MCLR                             BANKMASK(PORTE), 3, a
#define NEGATIVE                         BANKMASK(STATUS), 4, a
#define NOT_A                            BANKMASK(SSPSTAT), 5, a
#define NOT_ADDRESS                      BANKMASK(SSPSTAT), 5, a
#define NOT_BOR                          BANKMASK(RCON), 0, a
#define NOT_DONE                         BANKMASK(ADCON0), 1, a
#define NOT_DOWN                         BANKMASK(QEICON), 5, a
#define NOT_FLTA                         BANKMASK(PORTC), 1, a
#define NOT_FLTB                         BANKMASK(PORTC), 2, a
#define NOT_IPEN                         BANKMASK(RCON), 7, a
#define NOT_MCLR                         BANKMASK(PORTE), 3, a
#define NOT_PD                           BANKMASK(RCON), 2, a
#define NOT_POR                          BANKMASK(RCON), 1, a
#define NOT_RBPU                         BANKMASK(INTCON2), 7, a
#define NOT_RESEN                        BANKMASK(T5CON), 6, a
#define NOT_RI                           BANKMASK(RCON), 4, a
#define NOT_SS                           BANKMASK(PORTC), 6, a
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, a
#define NOT_T5SYNC                       BANKMASK(T5CON), 2, a
#define NOT_TO                           BANKMASK(RCON), 3, a
#define NOT_VELM                         BANKMASK(QEICON), 7, a
#define NOT_W                            BANKMASK(SSPSTAT), 2, a
#define NOT_WRITE                        BANKMASK(SSPSTAT), 2, a
#define OERR                             BANKMASK(RCSTA), 1, a
#define OSC1                             BANKMASK(PORTA), 7, a
#define OSC2                             BANKMASK(PORTA), 6, a
#define OSFIE                            BANKMASK(PIE2), 7, a
#define OSFIF                            BANKMASK(PIR2), 7, a
#define OSFIP                            BANKMASK(IPR2), 7, a
#define OSTS                             BANKMASK(OSCCON), 3, a
#define OSYNC                            BANKMASK(PWMCON1), 0, a
#define OV                               BANKMASK(STATUS), 3, a
#define OVERFLOW                         BANKMASK(STATUS), 3, a
#define PA1                              BANKMASK(PORTC), 2, a
#define PA2                              BANKMASK(PORTC), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PDEC0                            BANKMASK(QEICON), 0, a
#define PDEC1                            BANKMASK(QEICON), 1, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PMOD0                            BANKMASK(PWMCON0), 0, a
#define PMOD1                            BANKMASK(PWMCON0), 1, a
#define PMOD2                            BANKMASK(PWMCON0), 2, a
#define PMOD3                            BANKMASK(PWMCON0), 3, a
#define POR                              BANKMASK(RCON), 1, a
#define POUT0                            BANKMASK(OVDCONS), 0, a
#define POUT1                            BANKMASK(OVDCONS), 1, a
#define POUT2                            BANKMASK(OVDCONS), 2, a
#define POUT3                            BANKMASK(OVDCONS), 3, a
#define POUT4                            BANKMASK(OVDCONS), 4, a
#define POUT5                            BANKMASK(OVDCONS), 5, a
#define POUT6                            BANKMASK(OVDCONS), 6, a
#define POUT7                            BANKMASK(OVDCONS), 7, a
#define POVD0                            BANKMASK(OVDCOND), 0, a
#define POVD1                            BANKMASK(OVDCOND), 1, a
#define POVD2                            BANKMASK(OVDCOND), 2, a
#define POVD3                            BANKMASK(OVDCOND), 3, a
#define POVD4                            BANKMASK(OVDCOND), 4, a
#define POVD5                            BANKMASK(OVDCOND), 5, a
#define POVD6                            BANKMASK(OVDCOND), 6, a
#define POVD7                            BANKMASK(OVDCOND), 7, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PTCKPS0                          BANKMASK(PTCON0), 2, a
#define PTCKPS1                          BANKMASK(PTCON0), 3, a
#define PTDIR                            BANKMASK(PTCON1), 6, a
#define PTEN                             BANKMASK(PTCON1), 7, a
